# 1. 데이터 불러오기

In [2]:
# 필요한 모듈 가져오기
import pandas as pd

In [3]:
# 엑셀파일을 데이터프레임으로 변환
df = pd.read_excel('D:/박상춘/프로젝트/raw data/일반 음식점 데이터/07_24_04_P_일반음식점.xlsx', engine='openpyxl')

c:\Users\tjoeun\AppData\Local\Programs\Python\Python311\Lib\site-packages\openpyxl\styles\stylesheet.py:226: UserWarning: Workbook contains no default style, apply openpyxl's default
  warn("Workbook contains no default style, apply openpyxl's default")

# 2. 데이터 확인 및 전처리

In [4]:
df.head()

,번호,개방서비스명,개방서비스아이디,개방자치단체코드,관리번호,인허가일자,인허가취소일자,영업상태구분코드,영업상태명,상세영업상태코드,...,공장판매직직원수,공장생산직직원수,건물소유구분명,보증액,월세액,다중이용업소여부,시설총규모,전통업소지정번호,전통업소주된음식,홈페이지
0,396,일반음식점,07_24_04_P,3000000,3000000-101-2023-00038,2023-02-07,NaN,1,영업/정상,1,...,0,0,NaN,0,0,Y,172.90,NaN,NaN,NaN
1,3707,일반음식점,07_24_04_P,3080000,3080000-101-2023-00026,2023-02-07,NaN,1,영업/정상,1,...,0,0,NaN,0,0,N,493.74,NaN,NaN,NaN
2,3910,일반음식점,07_24_04_P,3090000,3090000-101-2023-00020,2023-02-07,NaN,1,영업/정상,1,...,0,0,NaN,0,0,N,83.00,NaN,NaN,NaN
3,3025,일반음식점,07_24_04_P,3060000,3060000-101-2023-00025,2023-02-07,NaN,1,영업/정상,1,...,0,0,NaN,0,0,N,113.08,NaN,NaN,NaN
4,3026,일반음식점,07_24_04_P,3060000,3060000-101-2023-00024,2023-02-07,NaN,1,영업/정상,1,...,0,0,NaN,0,0,N,49.58,NaN,NaN,NaN

In [5]:
# 컬럼 확인
df.columns

Index(['번호', '개방서비스명', '개방서비스아이디', '개방자치단체코드', '관리번호', '인허가일자', '인허가취소일자',
       '영업상태구분코드', '영업상태명', '상세영업상태코드', '상세영업상태명', '폐업일자', '휴업시작일자', '휴업종료일자',
       '재개업일자', '소재지전화', '소재지면적', '소재지우편번호', '소재지전체주소', '도로명전체주소', '도로명우편번호',
       '사업장명', '최종수정시점', '데이터갱신구분', '데이터갱신일자', '업태구분명', '좌표정보(X)', '좌표정보(Y)',
       '위생업태명', '남성종사자수', '여성종사자수', '영업장주변구분명', '등급구분명', '급수시설구분명', '총직원수',
       '본사직원수', '공장사무직직원수', '공장판매직직원수', '공장생산직직원수', '건물소유구분명', '보증액', '월세액',
       '다중이용업소여부', '시설총규모', '전통업소지정번호', '전통업소주된음식', '홈페이지'],
      dtype='object')

In [6]:
# 불필요한 컬럼 제거
df.drop(['번호', '개방서비스명', '개방서비스아이디', '개방자치단체코드', '관리번호', '인허가일자', '인허가취소일자', '영업상태구분코드', '영업상태명', '상세영업상태코드', '상세영업상태명', '폐업일자', '휴업시작일자', '휴업종료일자',
         '재개업일자', '소재지전화', '소재지면적', '소재지우편번호', '공장판매직직원수', '공장생산직직원수', '건물소유구분명', '보증액', '월세액', '다중이용업소여부', '시설총규모', '전통업소지정번호', '전통업소주된음식', '홈페이지',
         '소재지전체주소', '도로명우편번호', '최종수정시점', '데이터갱신구분', '데이터갱신일자', '남성종사자수', '여성종사자수', '영업장주변구분명', '등급구분명', '급수시설구분명', '총직원수', '본사직원수', '공장사무직직원수', '위생업태명'],
         axis=1, inplace=True)

In [7]:
# 컬럼 이름명 바꾸기
df.rename({'도로명전체주소':'address', '사업장명':'place_name', '업태구분명':'food', '좌표정보(X)':'latitude', '좌표정보(Y)':'longitude'}, axis=1, inplace=True)

In [8]:
df.head()

,address,place_name,food,latitude,longitude
0,"서울특별시 종로구 경희궁길 36, 지하1층 204호 (신문로2가)",커먼맨션,경양식,197287.415745,452294.360874
1,"서울특별시 강북구 4.19로 55, 1,2층 (수유동)",귀한돌짜장 매운갈비찜,한식,200682.917084,460435.453596
2,"서울특별시 도봉구 도봉로 493-4, 1층 (쌍문동)",할배골,한식,203012.670169,460828.952571
3,"서울특별시 중랑구 용마산로118길 67, 1층 (망우동)",망우로스팅랩,기타,209147.166204,455438.575009
4,"서울특별시 중랑구 양원역로 82, 101호 (망우동)",본죽&비빔밥 서울양원역점,기타,209279.447244,456130.266637

In [9]:
# 컬럼별 데이터 타입 확인
df.dtypes

address        object
place_name     object
food           object
latitude      float64
longitude     float64
dtype: object

In [10]:
# 결측치 확인
df.isnull().sum()

address         8
place_name      0
food            0
latitude      128
longitude     128
dtype: int64

In [11]:
# 결측치 제거
df = df.dropna()
df.isnull().sum()

address       0
place_name    0
food          0
latitude      0
longitude     0
dtype: int64

In [12]:
df

,address,place_name,food,latitude,longitude
0,"서울특별시 종로구 경희궁길 36, 지하1층 204호 (신문로2가)",커먼맨션,경양식,197287.415745,452294.360874
1,"서울특별시 강북구 4.19로 55, 1,2층 (수유동)",귀한돌짜장 매운갈비찜,한식,200682.917084,460435.453596
2,"서울특별시 도봉구 도봉로 493-4, 1층 (쌍문동)",할배골,한식,203012.670169,460828.952571
3,"서울특별시 중랑구 용마산로118길 67, 1층 (망우동)",망우로스팅랩,기타,209147.166204,455438.575009
4,"서울특별시 중랑구 양원역로 82, 101호 (망우동)",본죽&비빔밥 서울양원역점,기타,209279.447244,456130.266637
...,...,...,...,...,...
12240,"서울특별시 송파구 백제고분로 198, 1층 104호 (삼전동)",청년어부 삼전점,일식,207761.510501,444639.252711
12241,"서울특별시 송파구 올림픽로35가길 10, 1층 118호 (신천동, 잠실 더샵스타파크)",진전복 삼계탕 잠실직영점,한식,208972.490842,446087.944327
12242,"서울특별시 송파구 백제고분로40길 5, 2층 12호 (석촌동)",알이랑 고기랑 석촌점,한식,209324.864323,444648.957259
12243,"서울특별시 강동구 동남로81길 58, 1층 103호 (고덕동)",남도에서,한식,213510.482226,450829.307236
12244,"서울특별시 송파구 송파대로36가길 5, 1층 (송파동)",호산나 떡볶이,분식,210084.798360,444299.796514

In [13]:
# 인덱스 리셋
df.set_index([pd.Index(range(0, 12110))], inplace=True)

In [14]:
# 데이터 용량 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12110 entries, 0 to 12109
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   address     12110 non-null  object
 1   place_name  12110 non-null  object
 2   food        12110 non-null  object
 3   latitude    12110 non-null  float64
 4   longitude   12110 non-null  float64
dtypes: float64(2), object(3)
memory usage: 473.2+ KB

# 3. 데이터 프레임을 CSV 파일로 변환

In [15]:
df.to_csv('place_location.csv')